# Install Cask which will allow us to install almost any Mac program
tap 'caskroom/cask'
tap 'homebrew/services'
tap 'homebrew/php'

# PHP 7.1
brew 'php71'

brew 'git'  ## Version Control
brew 'npm'  ## Node Package Manager
brew 'curl' ## Download stuff

brew 'composer' ## PHP dependency manager

brew 'homebrew/php/phplint'

# Drush for Drupal development
brew 'drush'

brew 'dnsmasq'  ## DNS Mask for local virtual hosts
brew 'docker'   ## Docker
brew 'docker-compose'
brew 'docker-machine'

# SQL
brew 'mysql'
brew 'postgres'

# Install other browsers 
cask 'firefox'
cask 'opera'
cask 'google-chrome'

# Install Programs and Useful Stuff
## cask 'google-drive'
cask 'sublime-text'    ## Sublime Text 3 editor
brew 'emacs'           ## Emacs Terminal editor
brew 'tree'            ## Outputs nested, recursive directory listings
brew 'jq'              ## Command Line JSON processor
brew 'bash-completion' ## Bash auto-complete

# Install GUIs
cask 'postico'        ## PostgreSQL GUI
cask 'sequel-pro'     ## mySQL GUI
cask 'cronnix'        ## GUI for cron jobs

# Install Vagrant and VirtualBox for VMs
cask 'virtualbox'
cask 'vagrant'

# Install Useful Dev Apps
cask '1password'      ## Password tracking app
cask 'appcleaner'     ## Clean uninstall of apps. Removes all related files from system.
cask 'the-unarchiver' ## Unarchive anything.
cask 'dash'           ## Offline access to 150+ API documentations

# Install Other Apps
cask 'battle-net'     ## Battle.net for Hearthstone
cask 'discord'        ## Discord chat app
cask 'skype'          ## Video calling
cask 'slack'          ## Dev Communication app
cask 'viscosity'      ## VPN
cask 'obs'            ## Streaming App
## cask 'audacity'       ## Recording and Sound Mixing App
cask 'sketch'         ## Sketch program

## Apps to consider later
## Paw (cask 'paw') - API test GUI. $50.
